app/graphql/types/query_type.rb

SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def student(id:)
      ::Student.find(id)